Table of Contents
 Class IdeaMember1D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaMember1D : AbstractIdeaObject<IIdeaMember1D>, IEquatable<AbstractIdeaObject<IIdeaMember1D>>, IIdeaMember1D, IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObjectWithResults, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaMember1D>
IdeaMember1D
Implements
IEquatable<AbstractIdeaObject<IIdeaMember1D>>
IIdeaMember1D
IIdeaObjectConnectable
IIdeaPersistentObject
IIdeaObjectWithResults
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaMember1D>.Id
 AbstractIdeaObject<IIdeaMember1D>.Name
 AbstractIdeaObject<IIdeaMember1D>.Identifier
 AbstractIdeaObject<IIdeaMember1D>.GetHashCode()
 AbstractIdeaObject<IIdeaMember1D>.Equals(object)
 AbstractIdeaObject<IIdeaMember1D>.Equals(AbstractIdeaObject<IIdeaMember1D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaMember1D(Identifier<IIdeaMember1D>)
public IdeaMember1D(Identifier<IIdeaMember1D> identifer)
Parameters
identifer Identifier<IIdeaMember1D>
 IdeaMember1D(int)
public IdeaMember1D(int id)
Parameters
id int
 IdeaMember1D(string)
public IdeaMember1D(string id)
Parameters
id string
Properties
 Alignment
Alignment of the member's cross-section. Eccentricities are added up to the alignment.
public virtual Alignment Alignment { get; set; }
Property Value
Alignment
 CrossSection
Cross-section of the member.
public virtual IIdeaCrossSection CrossSection { get; set; }
Property Value
IIdeaCrossSection
 Elements
Elements this member consists of. Always returns a valid list with at least one element.
 The following guarantees are valid for the elements:
There is always at least one element in each member.
The first Element1D's IIdeaSegment3D's StartNode defines the start node of the member.
The N-th Element1D's IIdeaSegment3DEndNode is linked to the same node as (n+1)-th element's StartNode.
The Last Element1D's IIdeaSegment3DEndNode defines the end node of the member.
public virtual List<IIdeaElement1D> Elements { get; set; }
Property Value
List<IIdeaElement1D>
 MirrorY
Mirrors the cross-section of this member on the Y-axis.
public virtual bool MirrorY { get; set; }
Property Value
bool
 MirrorZ
Mirrors the cross-section of this member on the Z-axis.
public virtual bool MirrorZ { get; set; }
Property Value
bool
 Taper
Taper for specifying haunched member.
public virtual IIdeaTaper Taper { get; set; }
Property Value
IIdeaTaper
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Type
Type of member: beam, column, truss, rib or beamslab.
public virtual Member1DType Type { get; set; }
Property Value
Member1DType
Methods
 GetResults()
public virtual IEnumerable<IIdeaResult> GetResults()
Returns
IEnumerable<IIdeaResult>
 Edit this page